arendst/Tasmota/lib/lib_basic/stm32flash-1.0/stm32flash.cpp
		if (ret != 1) {
			DEBUG_MSG("Failed to read ACK byte");
			return STM32_ERR_UNKNOWN;
		}

		if (byte == STM32_ACK)
			return STM32_ERR_OK;
		if (byte == STM32_NACK)
			return STM32_ERR_NACK;
		if (byte != STM32_BUSY) {
			DEBUG_MSG("Got byte 0x%02x instead of ACK",
				byte);
			return STM32_ERR_UNKNOWN;
		}
	} while (1);
}

static stm32_err_t stm32_get_ack(const stm32_t *stm)
{
	return stm32_get_ack_timeout(stm, 0);
}

static stm32_err_t stm32_send_command_timeout(const stm32_t *stm,
					      const uint8_t cmd,
					      uint32_t timeout)
{
	Stream *stream = stm->stream;
	stm32_err_t s_err;
	size_t ret;
	uint8_t buf[2];

	buf[0] = cmd;
	buf[1] = cmd ^ 0xFF;
	ret = stream->write(buf, 2);
	if (ret != 2) {
		DEBUG_MSG("Failed to send command");
		return STM32_ERR_UNKNOWN;
	}
	s_err = stm32_get_ack_timeout(stm, timeout);
	if (s_err == STM32_ERR_OK)
		return STM32_ERR_OK;
	if (s_err == STM32_ERR_NACK)
		DEBUG_MSG("Got NACK from device on command 0x%02x", cmd);
	else
		DEBUG_MSG("Unexpected reply from device on command 0x%02x", cmd);
	return STM32_ERR_UNKNOWN;
}

static stm32_err_t stm32_send_command(const stm32_t *stm, const uint8_t cmd)
{
	return stm32_send_command_timeout(stm, cmd, 0);
}

/* if we have lost sync, send a wrong command and expect a NACK */
static stm32_err_t stm32_resync(const stm32_t *stm)
{
	Stream *stream = stm->stream;
	size_t ret;
	uint8_t buf[2], ack;
	uint32_t t0, t1;

	t0 = millis();
	t1 = t0;

	buf[0] = STM32_CMD_ERR;
	buf[1] = STM32_CMD_ERR ^ 0xFF;
	while (t1 < t0 + STM32_RESYNC_TIMEOUT) {
		ret = stream->write(buf, 2);
		if (ret == 0) {
			delay(500000);
			t1 = millis();
			continue;
		}
		ret = stream->readBytes(&ack, 1);
		if (ret == 0) {
			t1 = millis();
			continue;
		}
		if (ack == STM32_NACK)
			return STM32_ERR_OK;
		t1 = millis();
	}
	return STM32_ERR_UNKNOWN;
}

/*
 * some command receive reply frame with variable length, and length is
 * embedded in reply frame itself.
 * We can guess the length, but if we guess wrong the protocol gets out
 * of sync.
 * Use resync for frame oriented interfaces (e.g. I2C) and byte-by-byte
 * read for byte oriented interfaces (e.g. UART).
 *
 * to run safely, data buffer should be allocated for 256+1 bytes
 *
 * len is value of the first byte in the frame.
 */
static stm32_err_t stm32_guess_len_cmd(const stm32_t *stm, uint8_t cmd,
				       uint8_t *data, unsigned int len)
{
	Stream *stream = stm->stream;
	size_t ret;

	if (stm32_send_command(stm, cmd) != STM32_ERR_OK)
		return STM32_ERR_UNKNOWN;
	if (stm->flags & STREAM_OPT_BYTE) {
		/* interface is UART-like */
		ret = stream->readBytes(data, 1);
		if (ret != 1)
			return STM32_ERR_UNKNOWN;
		len = data[0];
		ret = stream->readBytes(data + 1, len + 1);
		if (ret != len + 1)
			return STM32_ERR_UNKNOWN;
		return STM32_ERR_OK;
	}

	ret = stream->readBytes(data, len + 2);
	if (ret == len + 2 && len == data[0])
		return STM32_ERR_OK;
	if (ret == 0 || ret != len + 2) {
		/* restart with only one byte */
		if (stm32_resync(stm) != STM32_ERR_OK)
			return STM32_ERR_UNKNOWN;
		if (stm32_send_command(stm, cmd) != STM32_ERR_OK)
			return STM32_ERR_UNKNOWN;
		ret = stream->readBytes(data, 1);
		if (ret != 1)
			return STM32_ERR_UNKNOWN;
	}

	DEBUG_MSG("Re sync (len = %d)", data[0]);
	if (stm32_resync(stm) != STM32_ERR_OK)
		return STM32_ERR_UNKNOWN;

	len = data[0];
	if (stm32_send_command(stm, cmd) != STM32_ERR_OK)
		return STM32_ERR_UNKNOWN;
	ret = stream->readBytes(data, len + 2);
	if (ret != len + 2)
		return STM32_ERR_UNKNOWN;
	return STM32_ERR_OK;
}

/*
 * Some interface, e.g. UART, requires a specific init sequence to let STM32
 * autodetect the interface speed.
 * The sequence is only required one time after reset.
 * This function sends the init sequence and, in case of timeout, recovers
 * the interface.
 */
static stm32_err_t stm32_send_init_seq(const stm32_t *stm)
{
	Stream *stream = stm->stream;
	size_t ret;
	uint8_t byte, cmd = STM32_CMD_INIT;

	ret = stream->write(&cmd, 1);
	if (ret != 1) {
		DEBUG_MSG("Failed to send init to device");
		return STM32_ERR_UNKNOWN;
	}
	ret = stream->readBytes(&byte, 1);
	if (ret == 1 && byte == STM32_ACK)
		return STM32_ERR_OK;
	if (ret == 1 && byte == STM32_NACK) {
		/* We could get error later, but let's continue, for now. */
		DEBUG_MSG("Warning: the interface was not closed properly.");
		return STM32_ERR_OK;
	}
	if (ret != 1) {
		DEBUG_MSG("Failed to init device.");
		return STM32_ERR_UNKNOWN;
	}

	/*
	 * Check if previous STM32_CMD_INIT was taken as first byte
	 * of a command. Send a new byte, we should get back a NACK.
	 */
	ret = stream->write(&cmd, 1);
	if (ret != 1) {
		DEBUG_MSG("Failed to send init to device");
		return STM32_ERR_UNKNOWN;
	}
	ret = stream->readBytes(&byte, 1);
	if (ret == 1 && byte == STM32_NACK)
		return STM32_ERR_OK;
	DEBUG_MSG("Failed to init device.");
	return STM32_ERR_UNKNOWN;
}

/* find newer command by higher code */
#define newer(prev, a) (((prev) == STM32_CMD_ERR) \
			? (a) \
			: (((prev) > (a)) ? (prev) : (a)))

stm32_t *stm32_init(Stream *stream, const uint8_t flags, const char init)
{
	uint8_t len, val, buf[257];
	stm32_t *stm;
	int i, new_cmds;

	stm      = (stm32_t *) calloc(sizeof(stm32_t), 1);
	stm->cmd = (stm32_cmd_t *) malloc(sizeof(stm32_cmd_t));
	memset(stm->cmd, STM32_CMD_ERR, sizeof(stm32_cmd_t));
	stm->stream = stream;
	stm->flags = flags;
	if (stm->flags & STREAM_OPT_I2C)
    stm->cmd_get_reply = i2c_cmd_get_reply;
    
	if ((stm->flags & STREAM_OPT_CMD_INIT) && init)
		if (stm32_send_init_seq(stm) != STM32_ERR_OK)
			return NULL;

	/* get the version and read protection status  */
	if (stm32_send_command(stm, STM32_CMD_GVR) != STM32_ERR_OK) {
		stm32_close(stm);
		return NULL;
	}

	/* From AN, only UART bootloader returns 3 bytes */
	len = (stm->flags & STREAM_OPT_GVR_ETX) ? 3 : 1;
	if (stream->readBytes(buf, len) != len)
		return NULL;
	stm->version = buf[0];
	stm->option1 = (stm->flags & STREAM_OPT_GVR_ETX) ? buf[1] : 0;
	stm->option2 = (stm->flags & STREAM_OPT_GVR_ETX) ? buf[2] : 0;
	if (stm32_get_ack(stm) != STM32_ERR_OK) {
		stm32_close(stm);
		return NULL;
	}

